Revit 2026 API

# DisplacementElementCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DisplacementElement Create(
	Document document,
	ICollection<ElementId> elementsToDisplace,
	XYZ displacement,
	View ownerDBView,
	DisplacementElement parentDisplacementElement
)
```
```vb
Public Shared Function Create (
	document As Document,
	elementsToDisplace As ICollection(Of ElementId),
	displacement As XYZ,
	ownerDBView As View,
	parentDisplacementElement As DisplacementElement
) As DisplacementElement
```
```cpp
public:
static DisplacementElement^ Create(
	Document^ document,
	ICollection<ElementId^>^ elementsToDisplace,
	XYZ^ displacement,
	View^ ownerDBView,
	DisplacementElement^ parentDisplacementElement
)
```
```fsharp
static member Create :
        document : Document *
        elementsToDisplace : ICollection<ElementId> *
        displacement : XYZ *
        ownerDBView : View *
        parentDisplacementElement : DisplacementElement -> DisplacementElement
```

#### Parameters

document Document

elementsToDisplace ICollectionElementId

displacement XYZ

ownerDBView View

parentDisplacementElement DisplacementElement

#### Return Value

DisplacementElement

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace